app/controllers/drivers/registrations_controller.rb

SELECT "locations".* FROM "locations"
---
   def new
     @locations = Location.all

INSERT INTO "ratings" ("driver_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["driver_id", 3], ["created_at", "2018-02-22 04:54:52.546033"], ["updated_at", "2018-02-22 04:54:52.546033"]]
---
  def create
    super
    driver = current_driver
    rating = Rating.create()