app/views/trip/create.html.erb

          <th>
            <%= trip.driver.rating.average %>
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."driver_id" = ? LIMIT ?  [["driver_id", 1], ["LIMIT", 1]]