app/controllers/drivers_controller.rb

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? ORDER BY "drivers"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    begin
      @user = Driver.find(params[:id])