app/controllers/passengers_controller.rb

SELECT  "passengers".* FROM "passengers" WHERE "passengers"."id" = ? ORDER BY "passengers"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    begin
      @user = Passenger.find(params[:id])