app/controllers/trip_controller.rb

SELECT "locations".* FROM "locations"
---
  def new
    @locations = Location.all

SELECT "drivers".* FROM "drivers" WHERE "drivers"."location_id" = ?  [["location_id", 2]]
---
  def create
    @allTrips = Hash.new
    origin = params[:origin]
    destination = params[:destination]
    session[:origin] = origin
    session[:destination] = destination
    distance = calculate_distance
    session[:distance] = distance
    Driver.where(location_id: origin).each do |driver|

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "drivers" SET "location_id" = ?, "updated_at" = ? WHERE "drivers"."id" = ?  [["location_id", 4], ["updated_at", "2018-02-23 04:07:03.956568"], ["id", 4]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "passengers" SET "balance" = ?, "updated_at" = ? WHERE "passengers"."id" = ?  [["balance", -743.85], ["updated_at", "2018-02-23 04:09:07.107095"], ["id", 4]]
---
  def finish_trip
    driver = Driver.find(session[:driver])
    cost = calculate_cost(driver.fare)
    driver.update_balance(cost)
    location = Location.find(session[:destination].to_i)
    driver.update_location(location.id)
    driver.rating.add(params[:rating].to_i)
    passenger = current_passenger
    passenger.update_balance(cost)